public class Utils {

        //methods

//        поиск сотрудника в массиве по его имени
//        поиск сотрудника в массиве по вхождению указанной строки в его имени
//        подсчет зарплатного бюджета для всех сотрудников в массиве
//        поиск наименьшей зарплаты в массиве
//        поиск наибольшей зарплаты в массиве
//        поиск наименьшего количества подчиненных в массиве менеджеров
//        поиск наибольшего количества подчиненных в массиве менеджеров
//        поиск наибольшей надбавки (разнице между базовой зарплатой и выплатой) в массиве менеджеров
//        поиск наименьшей надбавки (разнице между базовой ставки и зарплатой) в массиве менеджеров
}